In [5]:
import pandas as pd 
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, 7.8, 9, 20, 14.5, 8.8, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data,index =  ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    7.8         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    8.8         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [6]:
df.score.describe()

count    10.000000
mean     12.510000
std       4.702588
min       7.800000
25%       8.850000
50%      10.750000
75%      16.000000
max      20.000000
Name: score, dtype: float64

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     10 non-null     float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 280.0+ bytes

In [12]:
df.head(2)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no

In [18]:
df[['name', 'score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    7.8
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    8.8
i      Kevin    8.0
j      Jonas   19.0

In [22]:
df.iloc[[1, 4, 6, 7], [1, 3]]

   score qualify
b    9.0      no
e    9.0      no
g   14.5     yes
h    8.8      no

In [21]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    7.8         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    8.8         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [27]:
df[df['attempts']>2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    7.8         3      no
f  Michael   20.0         3     yes

In [28]:
df.shape

(10, 4)

In [29]:
len(df.axes[0])

10